eagle3-bench/pareto-results/llama3.1-8b_sharegpt_maxisl1024_osl512_tp1/eagle3/concurrency=32/bench.log
/localhome/local-triv/benchmark/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/eagle3-bench/datasets/sharegpt_isl128-1024.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=96, sharegpt_output_len=512, sharegpt_context_len=2048, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=32, output_file='/localhome/local-triv/benchmark/eagle3-bench/pareto-results/llama3.1-8b_sharegpt_maxisl1024_osl512_tp1/eagle3/concurrency=32/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/benchmark/eagle3-bench/datasets/sharegpt_isl128-1024.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=96, sharegpt_output_len=512, sharegpt_context_len=2048, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=32, output_file='/localhome/local-triv/benchmark/eagle3-bench/pareto-results/llama3.1-8b_sharegpt_maxisl1024_osl512_tp1/eagle3/concurrency=32/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 43489
#Output tokens: 49152
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 96/96 [01:28<00:00,  1.08it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     96        
Benchmark duration (s):                  89.00     
Total input tokens:                      43489     
Total generated tokens:                  49152     
Total generated tokens (retokenized):    49093     
Request throughput (req/s):              1.08      
Input token throughput (tok/s):          488.63    
Output token throughput (tok/s):         552.26    
Total token throughput (tok/s):          1040.88   
Concurrency:                             30.25     
Accept length:                           2.74      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   28049.19  
Median E2E Latency (ms):                 28466.28  
---------------Time to First Token----------------
Mean TTFT (ms):                          666.42    
Median TTFT (ms):                        317.72    
P99 TTFT (ms):                           2154.16   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           53.59     
Median ITL (ms):                         37.27     
P95 ITL (ms):                            142.90    
P99 ITL (ms):                            211.07    
Max ITL (ms):                            2860.63   
==================================================